; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	infrared0 - mode
	thermograph1 - mode
	Star0 - direction
	Star1 - direction
	Star5 - direction
	Star6 - direction
	GroundStation7 - direction
	GroundStation9 - direction
	Star8 - direction
	Star3 - direction
	Star4 - direction
	Star2 - direction
	Planet10 - direction
	Planet11 - direction
	Planet12 - direction
	Planet13 - direction
	Phenomenon14 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
)
(:init
	(supports instrument0 thermograph1)
	(supports instrument0 infrared0)
	(calibration_target instrument0 Star8)
	(supports instrument1 infrared0)
	(calibration_target instrument1 Star8)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument2 thermograph1)
	(supports instrument2 infrared0)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet13)
	(supports instrument3 thermograph1)
	(supports instrument3 infrared0)
	(calibration_target instrument3 Star4)
	(supports instrument4 thermograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star2)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star5)
)
(:goal (and
	(pointing satellite1 Phenomenon16)
	(have_image Planet10 thermograph1)
	(have_image Planet11 thermograph1)
	(have_image Planet12 thermograph1)
	(have_image Planet13 thermograph1)
))

)

; plan
1. (turn_to satellite0 star8 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 star8)
   goals met: 0 of 5
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 5
3. (calibrate satellite0 instrument0 star8)
   added: (calibrated instrument0)
   goals met: 0 of 5
4. (turn_to satellite0 planet11 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 planet11)
   goals met: 0 of 5
5. (take_image satellite0 planet11 instrument0 thermograph1)
   added: (have_image planet11 thermograph1)
   goals met: 1 of 5
6. (turn_to satellite0 planet10 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet10)
   goals met: 1 of 5
7. (take_image satellite0 planet10 instrument0 thermograph1)
   added: (have_image planet10 thermograph1)
   goals met: 2 of 5
8. (turn_to satellite0 planet12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 planet12)
   goals met: 2 of 5
9. (take_image satellite0 planet12 instrument0 thermograph1)
   added: (have_image planet12 thermograph1)
   goals met: 3 of 5
10. (turn_to satellite0 planet13 planet12)
   deleted: (pointing satellite0 planet12)
   added: (pointing satellite0 planet13)
   goals met: 3 of 5
11. (take_image satellite0 planet13 instrument0 thermograph1)
   added: (have_image planet13 thermograph1)
   goals met: 4 of 5
12. (turn_to satellite1 phenomenon16 planet13)
   deleted: (pointing satellite1 planet13)
   added: (pointing satellite1 phenomenon16)
   goals met: 5 of 5
